<img src="https://gallery.mailchimp.com/f98d5ac0a3fbbdcdda35136ab/images/2002af76-5fd4-4185-9d49-28558b6b8772.png">

# `sg-hdb-resale-abr` 
# Part 1: Extract, Transform, Load

In this notebook, I will be carry out steps and constructing structures that allows the following:
+ preliminary exploration of the raw data in terms of its state and format that it comes in
+ storing of extracted data in variables
+ loading extracted data into a database

These things takes one through the **ETL** process that is facilitated by a set of functions that makes a data pipeline. Albeit a simple one, beginners can learn from this whole process that we're about to go through.

<img src="https://i.ibb.co/wJQ4fK7/etl-workflow-image.png">

What is **ETL**?
+ **Extract:** This is the process of extracting data/information from the raw files. In our context here, the raw files have been provided to us in CSV form. In other enterprise use cases these raw files can come in other forms such as streamed JSON objects or transactional data from OLTP databases.
+ **Transform:** The process of converting data from the aforementioned extraction process to a digestible format to be ingested to another database or a datalake.
+ **Load:** Following transformation where the extracted data has been reformated, the process of loading all of it into a database comes under here.

In [1]:
# Begin by importing the packages we need
import os
import pandas as pd

<font color="blue"><h1><center>Extract</center></h1></font>
Download data at:
+ https://data.gov.sg/dataset/resale-flat-prices

__Resale Flat Prices:__ This dataset consist of transactions for HDB resale units.

This section is where we carry out the main objective of extracting the data from the CSV files containing information regarding HDB resale units. First, let us create a list containing the names of the .csv files within the directory containing the datasets.

In [2]:
# Set destination of folder containing raw data
file_loc = '../data/raw/resale-flat-prices/'
# This variable will contain every file in folder
file_list = os.listdir(file_loc)
# This variable only bothers with files ending with '.csv'
file_list_csv = [i for i in file_list if i.endswith('.csv')]
#print(file_list_csv)
for i in file_list_csv:
    print(i)

resale-flat-prices-based-on-approval-date-2000-feb-2012.csv
resale-flat-prices-based-on-registration-date-from-mar-2012-to-dec-2014.csv
resale-flat-prices-based-on-registration-date-from-jan-2015-onwards.csv
resale-flat-prices-based-on-approval-date-1990-1999.csv

The function that we will be creating below is to combine all the data from all the .csv files into one `pandas` dataframe. We will be using the `pandas` function `concat` to combine. Where a dataset does not have a certain variable that exists in the other dataset, the variable will be retained while filling in '0's for empty values. This is specifically referring to the variable `remaining_lease`.

In [3]:
def CombineDF(file_loc, file_list):
    
    print('type of file_loc = {}'.format(type(file_loc)))
    print('type of file_list = {}'.format(type(file_list)))
    
    
    dataset_files = []
    for i in file_list:
        dataset_files.append('{}{}'.format(file_loc,i))
        
    print('the files that we will be importing: {}'.format(dataset_files))
    
    frames = [ pd.read_csv(f) for f in list(dataset_files)]
    
    #fillna is used here as only 1 of the csv has remaining_least, fillna will fill those without 0
    combi_result = pd.concat(frames, ignore_index=True).fillna(0)
    return combi_result

In [4]:
# Utilise the newly created functions
hdb_combi_df = CombineDF(file_loc,file_list_csv)

type of file_loc = <class 'str'>
type of file_list = <class 'list'>
the files that we will be importing: ['../data/raw/resale-flat-prices/resale-flat-prices-based-on-approval-date-2000-feb-2012.csv', '../data/raw/resale-flat-prices/resale-flat-prices-based-on-registration-date-from-mar-2012-to-dec-2014.csv', '../data/raw/resale-flat-prices/resale-flat-prices-based-on-registration-date-from-jan-2015-onwards.csv', '../data/raw/resale-flat-prices/resale-flat-prices-based-on-approval-date-1990-1999.csv']

In [5]:
# Printing the first 5 observations of dataframe
hdb_combi_df.head(5)

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,2000-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,159000.0,0.0
1,2000-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,New Generation,1976,167000.0,0.0
2,2000-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,New Generation,1976,163000.0,0.0
3,2000-01,ANG MO KIO,4 ROOM,304,ANG MO KIO AVE 1,04 TO 06,97.0,New Generation,1977,260000.0,0.0
4,2000-01,ANG MO KIO,5 ROOM,221,ANG MO KIO AVE 1,10 TO 12,127.0,Improved,1993,408000.0,0.0

In [6]:
# https://stackoverflow.com/questions/41328633/how-do-i-print-entire-number-in-python-from-describe-function
# pd.set_option('float_format','{:f}'.format)
hdb_combi_df.describe()

       floor_area_sqm  lease_commence_date  resale_price  remaining_lease
count   790643.000000        790643.000000  7.906430e+05    790643.000000
mean        95.536170          1986.759077  2.867182e+05         7.550482
std         26.165474             9.036475  1.452341e+05        22.704355
min         28.000000          1966.000000  5.000000e+03         0.000000
25%         72.000000          1980.000000  1.770000e+05         0.000000
50%         93.000000          1985.000000  2.680000e+05         0.000000
75%        114.000000          1993.000000  3.750000e+05         0.000000
max        307.000000          2016.000000  1.185000e+06        97.000000

In [7]:
hdb_combi_df.shape

(790643, 11)

<font color="blue"><h1><center>Transform</center></h1></font>

The data that we have extracted from the CSV files are quite clean and hence we can choose to not do any transformation prior to the loading process. Of course, in the real world, hardly ever do we get such luck.
Further transformations for the purpose of feature engineering can be implemented during the [modelling phase](./sg-hdb-part2-modelling.ipynb).

Even though the formatting/state of the dataset is good enough for us to ingest into a database, for the purpose of this exercise, let us transform the values of a single variable.

Currently, as seen below, the variable `flat_model` contains many (35) different categories and some are mismatched.

In [8]:
# Display unique values for the variable
hdb_combi_df['flat_model'].unique()

array(['New Generation', 'Improved', 'Model A', 'Standard', 'Apartment',
       'Model A-Maisonette', 'Maisonette', 'Simplified',
       'Multi Generation', 'Adjoined flat', 'Premium Apartment',
       'Terrace', 'Improved-Maisonette', 'Premium Maisonette', '2-room',
       'Model A2', 'DBSS', 'Type S1', 'Type S2', 'Premium Apartment Loft',
       'Premium Apartment.', 'IMPROVED', 'NEW GENERATION', 'STANDARD',
       'MODEL A', 'SIMPLIFIED', 'MODEL A-MAISONETTE', 'APARTMENT',
       'MAISONETTE', 'ADJOINED FLAT', 'TERRACE', '2-ROOM',
       'IMPROVED-MAISONETTE', 'MULTI GENERATION', 'PREMIUM APARTMENT'],
      dtype=object)

In [9]:
# Display no. of categories for the variable
len(hdb_combi_df['flat_model'].unique())

35

We have many different categories but some of them are linked to the same one category and are actually just spelled differently due to entry methods. For example we have the following categories as observed from above:
+ 'Model A'
+ 'MODEL A'

Both are pertaining to a single model category but due to the different casings they are treated as different categories. A simple act of transformation that we can employ is to just convert every letter of the values in the `flat_model` column to lowercase.

In [10]:
#make all text unique, ie, all lower case
hdb_combi_df['flat_model'] = hdb_combi_df['flat_model'].str.lower()

In [11]:
# Display unique values for the column
hdb_combi_df['flat_model'].unique()

array(['new generation', 'improved', 'model a', 'standard', 'apartment',
       'model a-maisonette', 'maisonette', 'simplified',
       'multi generation', 'adjoined flat', 'premium apartment',
       'terrace', 'improved-maisonette', 'premium maisonette', '2-room',
       'model a2', 'dbss', 'type s1', 'type s2', 'premium apartment loft',
       'premium apartment.'], dtype=object)

In [12]:
# Display no. of categories for the variable after transformation
len(hdb_combi_df['flat_model'].unique())

21

As you can see, through transformation we are able to handle mismatched categories and in this sense, we have only done some form of preliminary data cleaning but that of course does not deviate from the essence of the transformation process.

Let us now export the extracted data to one single .csv file for checkpoint.

In [13]:
hdb_combi_df.to_csv("../data/interim/sg-resale-flat-prices-1990-to-2019-jan.csv", index=False)

In [14]:
# Include index for dataframe and renaming the column to 'id'
hdb_combi_df.reset_index(level=0,inplace=True)
hdb_combi_df.head()

,index,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,0,2000-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,new generation,1976,159000.0,0.0
1,1,2000-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,new generation,1976,167000.0,0.0
2,2,2000-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,new generation,1976,163000.0,0.0
3,3,2000-01,ANG MO KIO,4 ROOM,304,ANG MO KIO AVE 1,04 TO 06,97.0,new generation,1977,260000.0,0.0
4,4,2000-01,ANG MO KIO,5 ROOM,221,ANG MO KIO AVE 1,10 TO 12,127.0,improved,1993,408000.0,0.0

In [15]:
# Renaming the 'index' column
hdb_combi_df.columns.values[0] = 'id'

In [16]:
hdb_combi_df.columns.value_counts

<bound method IndexOpsMixin.value_counts of Index(['id', 'month', 'town', 'flat_type', 'block', 'street_name',
       'storey_range', 'floor_area_sqm', 'flat_model', 'lease_commence_date',
       'resale_price', 'remaining_lease'],
      dtype='object')>

In [17]:
hdb_combi_df.head()

,id,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,0,2000-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,new generation,1976,159000.0,0.0
1,1,2000-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,new generation,1976,167000.0,0.0
2,2,2000-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,new generation,1976,163000.0,0.0
3,3,2000-01,ANG MO KIO,4 ROOM,304,ANG MO KIO AVE 1,04 TO 06,97.0,new generation,1977,260000.0,0.0
4,4,2000-01,ANG MO KIO,5 ROOM,221,ANG MO KIO AVE 1,10 TO 12,127.0,improved,1993,408000.0,0.0

<font color="blue"><h1><center>Load</center></h1></font>

Following extraction and transformation, we now intend to load the data derived from the above processes into a simple [SQLite](https://www.sqlite.org/index.html) RDMS/database. 
(For simplicity's sake, we'll use SQLite for now. In the future, one might want to take a look into remote alternatives.)

# SQLite

In [18]:
import os
import sys
import sqlalchemy  #sudo apt-get install python3-sqlalchemy
from sqlalchemy import Table, Column, Integer, String, Float
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

Quick observation on how the dataset that we intend to load into the database looks like.

In [19]:
hdb_combi_df.head()

,id,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,resale_price,remaining_lease
0,0,2000-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,07 TO 09,73.0,new generation,1976,159000.0,0.0
1,1,2000-01,ANG MO KIO,3 ROOM,215,ANG MO KIO AVE 1,07 TO 09,73.0,new generation,1976,167000.0,0.0
2,2,2000-01,ANG MO KIO,3 ROOM,218,ANG MO KIO AVE 1,07 TO 09,67.0,new generation,1976,163000.0,0.0
3,3,2000-01,ANG MO KIO,4 ROOM,304,ANG MO KIO AVE 1,04 TO 06,97.0,new generation,1977,260000.0,0.0
4,4,2000-01,ANG MO KIO,5 ROOM,221,ANG MO KIO AVE 1,10 TO 12,127.0,improved,1993,408000.0,0.0

For the next few cells, we will be working towards creating the database:
+ create engine to initialise connection
+ specify table names and their columns

In [20]:
# Create engine
engine = create_engine('sqlite:///../data/processed/sg_hdb.db')
Base = declarative_base()

In [21]:
# Specify properties for tables
class HDBRes(Base):
    # Specifying the table name
    __tablename__ = 'sg_hdb_resale'
    
    # Specifying the column headings and types for this table
    id = Column(Integer, primary_key=True)
    block = Column(String(7))
    flat_model = Column(String(30))
    flat_type = Column(String(20))
    floor_area_sqm = Column(Float())
    lease_commence_date = Column(Integer())
    month = Column(String(7))
    remaining_lease = Column(Integer())
    resale_price = Column(Float())
    storey_range = Column(String(15))
    street_name = Column(String(50))
    town = Column(String(20))

In [22]:
# base, then create engine
# https://stackoverflow.com/questions/15175339/sqlalchemy-what-is-declarative-base#:~:text=declarative_base()%20is%20a%20factory,Base%20variable%20in%20your%20example).

# declarative_base() is a factory function that constructs a base class for declarative class definitions (which is assigned to the Base variable in your example). The one you created in user.py is associated with the User model, while the other one (in main.py) is a different class and doesn't know anything about your models, that's why the Base.metadata.create_all() call didn't create the table. You need to import Base from user.py

# Create tables as defined above
Base.metadata.create_all(engine)

Here, we create a function that allows us to connect with the database created from above and insert values from relevant `pandas` dataframes into the SQLite database.

In [23]:
def SGHDBBulkInsert(table_name, df_to_insert, engine_loc):
    engine = create_engine(engine_loc)
    
    # The orient='records' is the key of this, it allows to align with the format mentioned in the doc to insert in bulks.
    list_to_write = df_to_insert.to_dict(orient='records')
    metadata = sqlalchemy.schema.MetaData(bind=engine)
    table = sqlalchemy.Table(table_name, metadata, autoload=True)
    
    # Open the session
    Session = sessionmaker(bind=engine)
    session = Session()
    
    conn = engine.connect()
    # Insert the dataframe into the database in one bulk
    conn.execute(table.insert(), list_to_write)
    # Commit the changes
    session.commit()
    # Close the session
    session.close()

In [24]:
# Executing insertion of the HDB Resale data
SGHDBBulkInsert('sg_hdb_resale', hdb_combi_df, 'sqlite:///../data/processed/sg_hdb.db')

To observe as to whether the intended operations have been executed successfully, we can use relevant GUI tools to examine the contents of databases. For SQLite, we can use [DB Browser for SQLite](https://sqlitebrowser.org/dl/). Once we have loaded the relevant data into our database, it is time for us to work on a simple machine learning model. On to the next part [here](./sg-hdb-part2-modelling.ipynb)!